Tekla.Structures.Geometry3d.Vector
The Vector class defines a direction and magnitude from the current origin.

Tekla.Structures.Geometry3d.Vector.#ctor
Instantiates a zero length vector.

Tekla.Structures.Geometry3d.Vector.#ctor(System.Double,System.Double,System.Double)
Instantiates a vector with the given coordinates.
X: The X-coordinate to be used.
Y: The Y-coordinate to be used.
Z: The Z-coordinate to be used.

Tekla.Structures.Geometry3d.Vector.#ctor(Tekla.Structures.Geometry3d.Point)
Instatiates a new vector with the given point.
Point: The point to be used.

Tekla.Structures.Geometry3d.Vector.Normalize
Normalizes the vector using the length 1.0 (the length of a unit vector).
Returns: The normalized vector's length.

Tekla.Structures.Geometry3d.Vector.Normalize(System.Double)
Normalizes the vector using the given length.
NewLength: The length to be used.
Returns: The normalized vector's length.

Tekla.Structures.Geometry3d.Vector.GetLength
Gets the length (magnitude) of a vector.
Returns: The vector's length.

Tekla.Structures.Geometry3d.Vector.GetAngleBetween(Tekla.Structures.Geometry3d.Vector)
Gets the angle (in radians) between the current vector and the given vector.
Vector: The vector to be used.
Returns: The angle between the vectors in radians.

Tekla.Structures.Geometry3d.Vector.GetNormal
Returns a new normalized equivalent of the current vector.
Returns: The normalized equivalent of the current vector.

Tekla.Structures.Geometry3d.Vector.Dot(Tekla.Structures.Geometry3d.Vector)
Returns a dot product of the current vector and the given vector.
Vector: The vector to be used.
Returns: The dot product of the vectors.

Tekla.Structures.Geometry3d.Vector.Dot(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Returns a dot product of the given two vectors.
Vector1: The first vector to be used.
Vector2: The second vector to be used.
Returns: The dot product of the vectors.

Tekla.Structures.Geometry3d.Vector.Cross(Tekla.Structures.Geometry3d.Vector)
Returns a new cross product vector of the current vector and the given vector.
Vector: The vector to be used.
Returns: The new cross product vector.

Tekla.Structures.Geometry3d.Vector.Cross(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Returns a new cross product vector of the given two vectors.
Vector1: The first vector to be used.
Vector2: The second vector to be used.
Returns: The new cross product vector.

Tekla.Structures.Geometry3d.Vector.op_Multiply(Tekla.Structures.Geometry3d.Vector,System.Double)
Calculates the multiplication of the given vector with the given scalar.
Vector: The vector to be multiplied.
Multiplier: The scalar to multiply the vector with.
Returns: The new vector that is the multiplication of the vector and the scalar.

Tekla.Structures.Geometry3d.Vector.op_Multiply(System.Double,Tekla.Structures.Geometry3d.Vector)
Calculates the multiplication of the given vector with the given scalar.
Multiplier: The scalar to multiply the vector with.
Vector: The vector to be multiplied.
Returns: The new vector that is the multiplication of the vector and the scalar.

Tekla.Structures.Geometry3d.Vector.ToString
Formats the 3D vector into a string with fixed decimals, in the following way: "(X, Y, Z)".
Returns: The string that represents the vector.